[
  {
    "title": "SXSW: Boldly Go: Enterprise Apps, from Idea to Market",
    "date": "2003-03-12",
    "url": "https://schedule.sxsw.com/2013/events/event_IAP6143",
    "description": "There are several strategic steps developers must take as they set out to create a beautiful app which then, in a perfect world, morphs into a business. We'll talk about the best lines of business and where you can have the most beneficial impact. We'll also cover technical issues like how to implement an API layer to facilitate the flow of data into or out of your application or solution; how to manage and deliver the data, how to find and connect to the enterprises systems, databases and other services that you need; and last but not least, how to bring your beautiful app to market, from testing to monetizing."
  },
  {
    "title": "Mobile World Congress 2013",
    "date": "2013-02-24",
    "url": "https://www.mwcbarcelona.com/",
    "description": "Barcelona, Spain. I'll be participating in the SAP Developer Zone at the conference."
  },
  {
    "title": "SAP TechEd & d-code 2014 - Las Vegas",
    "date": "2014-10-20",
    "url": "https://sessioncatalog.sapevents.com/go/agendabuilder.closed/?l=84&locale=en_US",
    "description": "As the product manager for several mobile products at SAP, I'm excited to have the opportunity to present several sessions at this year's TechEd & d-code conference in Las Vegas. If you're there, look me up."
  },
  {
    "title": "SAP TechEd & d-code 2014 - Berlin",
    "date": "2014-11-11",
    "url": "https://sessioncatalog.sapevents.com/go/agendabuilder.closed/?l=85&locale=en_US",
    "description": "As the product manager for several mobile products at SAP, I'm excited to have the opportunity to present several sessions at this year's TechEd & d-code conference in Berlin. If you're there, look me up."
  },
  {
    "title": "O'Reilly: Progressive Web Apps: Enhancing Your Web Apps Using Service Workers",
    "date": "2020-08-14",
    "url": "https://www.oreilly.com/live-events/progressive-web-apps-enhancing-your-web-apps-using-service-workers/0636920409861/0636920409854/",
    "description": "Progressive Web Apps (PWAs) are the bright future of desktop and mobile applications. Research firm Gartner was so confident in the growth of PWAs that they predicted that 50% of all consumer apps would be PWAs this year. In this fast-paced session chock full of technical details, you’ll learn how build your own progressive web applications. You’ll learn how to make your app installable using web app manifests and some JavaScript code. You’ll also learn how to make your web app work in offline mode on compatible browsers using service workers. You’ll also learn about all the ways service workers can enhance the capabilities of a web application."
  },
  {
    "title": "Write Shell Scripts Using JavaScript and zx",
    "date": "2023-10-17",
    "url": "https://2023.allthingsopen.org/sessions/write-shell-scripts-using-javascript-and-zx/",
    "description": "There are many different ways to automate stuff when you’re building and writing software, shell scripts, CI/CD, command-line utilities and more. When you need to run something locally, developers often turn to shell scripts for something simple and node-based command-line utilities for more complicated tasks. Google’s `zx` project sits right between those two options, merging shell commands with JavaScript (or even TypeScript) coding. In this session, you’ll learn how to write shell scripts using JavaScript and zx."
  }
]